---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeConnectiontypeParam
source: html/bdeb29cc-d5ad-0b68-e6b6-4b8f62514c74.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeConnectiontypeParam Property

"Connection Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeConnectiontypeParam { get; }
```